Repository: imrbogdan/auto-image-tags
Catalog: languages/auto-image-tags-*.po
Languages: ru_ru

source: Settings
ru_ru: Настройки

source: Process Images
ru_ru: Обработать изображения

source: Preview
ru_ru: Предпросмотр

source: Statistics
ru_ru: Статистика

source: Tools
ru_ru: Инструменты

source: Translation
ru_ru: Перевод

source: About
ru_ru: О плагине

source: Language Settings
ru_ru: Настройки языка

source: Plugin Language
ru_ru: Язык плагина

source: Automatic (site language)
ru_ru: Автоматически (язык сайта)

source: Select plugin interface language
ru_ru: Выберите язык интерфейса плагина

source: Tag Formats
ru_ru: Форматы тегов

source: ALT Tag Format
ru_ru: Формат тега ALT

source: TITLE Tag Format
ru_ru: Формат тега TITLE

source: Caption Format
ru_ru: Формат подписи

source: Description Format
ru_ru: Формат описания

source: Do not change
ru_ru: Не изменять

source: Filename
ru_ru: Имя файла

source: Post/Page Title
ru_ru: Заголовок поста/страницы

source: Site Name
ru_ru: Название сайта

source: Filename + Post Title
ru_ru: Имя файла + Заголовок поста

source: Filename + Site Name
ru_ru: Имя файла + Название сайта

source: Custom Text
ru_ru: Произвольный текст

source: Overwrite existing
ru_ru: Перезаписать существующие

source: Custom ALT Text
ru_ru: Произвольный текст ALT

source: Custom TITLE Text
ru_ru: Произвольный текст TITLE

source: Use variables: {filename}, {posttitle}, {sitename}, {category}, {tags}, {author}, {date}, {year}, {month}
ru_ru: Используйте переменные: {filename}, {posttitle}, {sitename}, {category}, {tags}, {author}, {date}, {year}, {month}

source: Filename Processing
ru_ru: Обработка имён файлов

source: Cleanup Options
ru_ru: Опции очистки

source: Replace hyphens and underscores with spaces
ru_ru: Заменить дефисы и подчёркивания пробелами

source: Remove dots from filenames
ru_ru: Удалить точки из имён файлов

source: Capitalize first letter of each word
ru_ru: Первая буква каждого слова заглавная

source: Remove camera numbers (DSC_0001, IMG_20231225)
ru_ru: Удалить номера камер (DSC_0001, IMG_20231225)

source: Split CamelCase (PhotoOfProduct → Photo Of Product)
ru_ru: Разделить CamelCase (PhotoOfProduct → Photo Of Product)

source: Remove size suffixes (-300x200, -scaled, -thumb)
ru_ru: Удалить суффиксы размеров (-300x200, -scaled, -thumb)

source: Stop Words
ru_ru: Стоп-слова

source: Words to remove from filenames, comma-separated
ru_ru: Слова для удаления из имён файлов, через запятую

source: Additional Settings
ru_ru: Дополнительные настройки

source: Operation Mode
ru_ru: Режим работы

source: Process images on upload
ru_ru: Обрабатывать изображения при загрузке

source: Test Mode (no changes saved)
ru_ru: Тестовый режим (изменения не сохраняются)

source: WooCommerce Integration
ru_ru: Интеграция с WooCommerce

source: Main Settings
ru_ru: Основные настройки

source: Enable WooCommerce product image processing
ru_ru: Включить обработку изображений товаров WooCommerce

source: Process product gallery (additional images)
ru_ru: Обрабатывать галерею товара (дополнительные изображения)

source: Use in tags:
ru_ru: Использовать в тегах:

source: Product title
ru_ru: Название товара

source: Product category
ru_ru: Категория товара

source: Product SKU
ru_ru: Артикул товара

source: This data will be added to processed product image tags
ru_ru: Эти данные будут добавлены в теги обработанных изображений товаров

source: WooCommerce is not installed. Install and activate WooCommerce to use this feature.
ru_ru: WooCommerce не установлен. Установите и активируйте WooCommerce для использования этой функции.

source: Preview Changes
ru_ru: Предпросмотр изменений

source: Here you can see how tags will look after processing, without making real changes.
ru_ru: Здесь вы можете увидеть, как будут выглядеть теги после обработки, не внося реальных изменений.

source: Filters
ru_ru: Фильтры

source: Number of images:
ru_ru: Количество изображений:

source: Show:
ru_ru: Показать:

source: All images
ru_ru: Все изображения

source: Without ALT tag
ru_ru: Без тега ALT

source: Without TITLE tag
ru_ru: Без тега TITLE

source: Without tags
ru_ru: Без тегов

source: Load Preview
ru_ru: Загрузить предпросмотр

source: Preview Results
ru_ru: Результаты предпросмотра

source: Process Existing Images
ru_ru: Обработать существующие изображения

source: Test Mode Active!
ru_ru: Тестовый режим активен!

source: Changes will not be saved. Disable test mode in settings for real processing.
ru_ru: Изменения не будут сохранены. Отключите тестовый режим в настройках для реальной обработки.

source: Warning!
ru_ru: Внимание!

source: It is recommended to create a database backup before bulk processing.
ru_ru: Рекомендуется создать резервную копию базы данных перед массовой обработкой.

source: Processing Filters
ru_ru: Фильтры обработки

source: Upload Period:
ru_ru: Период загрузки:

source: All time
ru_ru: За всё время

source: Today
ru_ru: Сегодня

source: Last week
ru_ru: Последняя неделя

source: Last month
ru_ru: Последний месяц

source: Last year
ru_ru: Последний год

source: Status:
ru_ru: Статус:

source: Without ALT
ru_ru: Без ALT

source: Without TITLE
ru_ru: Без TITLE

source: Post/Page:
ru_ru: Пост/Страница:

source: All
ru_ru: Все

source: Loading...
ru_ru: Загрузка...

source: Loading statistics...
ru_ru: Загрузка статистики...

source: Start Processing
ru_ru: Начать обработку

source: Processing Results:
ru_ru: Результаты обработки:

source: Processing Statistics
ru_ru: Статистика обработки

source: Overall Statistics
ru_ru: Общая статистика

source: Total Processed:
ru_ru: Всего обработано:

source: Successfully Updated:
ru_ru: Успешно обновлено:

source: Processing History
ru_ru: История обработки

source: Date
ru_ru: Дата

source: Total
ru_ru: Всего

source: Processed
ru_ru: Обработано

source: Success
ru_ru: Успешно

source: Skipped
ru_ru: Пропущено

source: Errors
ru_ru: Ошибок

source: Mode
ru_ru: Режим

source: Test
ru_ru: Тест

source: Normal
ru_ru: Обычный

source: Processing history is empty.
ru_ru: История обработки пуста.

source: About Auto Image Tags Plugin
ru_ru: О плагине Auto Image Tags

source: Plugin Information
ru_ru: Информация о плагине

source: Version:
ru_ru: Версия:

source: Author:
ru_ru: Автор:

source: Plugin Features
ru_ru: Возможности плагина

source: Automatic ALT, TITLE, Caption and Description generation
ru_ru: Автоматическая генерация ALT, TITLE, подписи и описания

source: Preview changes before applying
ru_ru: Предпросмотр изменений перед применением

source: Individual overwrite settings for each attribute
ru_ru: Индивидуальные настройки перезаписи для каждого атрибута

source: Bulk processing filters (by date, posts, status)
ru_ru: Фильтры массовой обработки (по дате, постам, статусу)

source: Advanced filename cleanup
ru_ru: Расширенная очистка имён файлов

source: Stop words to remove unwanted words
ru_ru: Стоп-слова для удаления нежелательных слов

source: Test mode for safe testing
ru_ru: Тестовый режим для безопасного тестирования

source: Processing history and statistics
ru_ru: История обработки и статистика

source: Multilingual support
ru_ru: Многоязычная поддержка

source: Extended template variables
ru_ru: Расширенные переменные шаблонов

source: Translation system (5 services)
ru_ru: Система перевода (5 сервисов)

source: What's New in Version 2.0.0
ru_ru: Что нового в версии 2.0.0

source: Tools tab (bulk delete, export/import settings)
ru_ru: Вкладка инструментов (массовое удаление, экспорт/импорт настроек)

source: Preview tab with before/after comparison
ru_ru: Вкладка предпросмотра со сравнением до/после

source: Caption and Description support
ru_ru: Поддержка подписи и описания

source: Individual overwrite settings
ru_ru: Индивидуальные настройки перезаписи

source: Advanced filters
ru_ru: Расширенные фильтры

source: Enhanced filename cleanup
ru_ru: Улучшенная очистка имён файлов

source: Custom stop words
ru_ru: Пользовательские стоп-слова

source: Statistics and history
ru_ru: Статистика и история

source: Language selection
ru_ru: Выбор языка

source: Support and Feedback
ru_ru: Поддержка и обратная связь

source: If you have questions, suggestions or found a bug, contact me via Telegram.
ru_ru: Если у вас есть вопросы, предложения или вы нашли ошибку, свяжитесь со мной через Telegram.

source: Plugin is distributed for free to help the WordPress community.
ru_ru: Плагин распространяется бесплатно, чтобы помочь сообществу WordPress.

source: All features are available for free, no Pro version!
ru_ru: Все функции доступны бесплатно, нет Pro версии!

source: Bulk Tag Removal
ru_ru: Массовое удаление тегов

source: Remove ALT, TITLE, Caption and Description from selected images.
ru_ru: Удалить ALT, TITLE, подпись и описание из выбранных изображений.

source: This action is irreversible. It is recommended to create a database backup before removal.
ru_ru: Это действие необратимо. Рекомендуется создать резервную копию базы данных перед удалением.

source: What to remove:
ru_ru: Что удалить:

source: ALT tags
ru_ru: Теги ALT

source: TITLE (image title)
ru_ru: TITLE (название изображения)

source: Caption
ru_ru: Подпись

source: Description
ru_ru: Описание

source: Upload period:
ru_ru: Период загрузки:

source: Remove Tags
ru_ru: Удалить теги

source: Removal Results:
ru_ru: Результаты удаления:

source: Export/Import Settings
ru_ru: Экспорт/Импорт настроек

source: Save plugin settings to a file or load previously saved settings.
ru_ru: Сохраните настройки плагина в файл или загрузите ранее сохранённые настройки.

source: Export settings:
ru_ru: Экспорт настроек:

source: 📥 Download Settings
ru_ru: 📥 Скачать настройки

source: Saves current plugin settings to a JSON file
ru_ru: Сохраняет текущие настройки плагина в JSON файл

source: Import settings:
ru_ru: Импорт настроек:

source: 📤 Upload Settings
ru_ru: 📤 Загрузить настройки

source: Loads settings from a previously saved JSON file
ru_ru: Загружает настройки из ранее сохранённого JSON файла

source: Automatic Image Tag Translation
ru_ru: Автоматический перевод тегов изображений

source: Translate ALT, TITLE, Caption and Description using various translation services.
ru_ru: Переводите ALT, TITLE, подпись и описание с помощью различных сервисов перевода.

source: API Settings
ru_ru: Настройки API

source: Translation Service:
ru_ru: Сервис перевода:

source: API Key:
ru_ru: API ключ:

source: Get API key:
ru_ru: Получить API ключ:

source: ⚠️ Paid service. First $300 free for new users.
ru_ru: ⚠️ Платный сервис. Первые $300 бесплатно для новых пользователей.

source: ✅ Free: 500,000 characters per month
ru_ru: ✅ Бесплатно: 500 000 символов в месяц

source: ✅ Free: 1,000,000 characters per month
ru_ru: ✅ Бесплатно: 1 000 000 символов в месяц

source: Server URL:
ru_ru: URL сервера:

source: Public server:
ru_ru: Публичный сервер:

source: Server list:
ru_ru: Список серверов:

source: ✅ Completely free and open-source
ru_ru: ✅ Полностью бесплатный и открытый

source: Email (optional):
ru_ru: Email (необязательно):

source: Email increases limit from 5,000 to 10,000 characters per day
ru_ru: Email увеличивает лимит с 5 000 до 10 000 символов в день

source: Information:
ru_ru: Информация:

source: ✅ Free: 5,000 characters per day (10,000 with email)
ru_ru: ✅ Бесплатно: 5 000 символов в день (10 000 с email)

source: Source Language:
ru_ru: Исходный язык:

source: Target Language:
ru_ru: Целевой язык:

source: What to Translate
ru_ru: Что переводить

source: Fields to translate:
ru_ru: Поля для перевода:

source: Auto-translation:
ru_ru: Автоперевод:

source: Automatically translate tags when uploading images
ru_ru: Автоматически переводить теги при загрузке изображений

source: Save Settings
ru_ru: Сохранить настройки

source: Test Translation
ru_ru: Тестовый перевод

source: Check API functionality before bulk translation
ru_ru: Проверьте работу API перед массовым переводом

source: Text to translate:
ru_ru: Текст для перевода:

source: Bulk Translation
ru_ru: Массовый перевод

source: Translate all existing image tags
ru_ru: Перевести все существующие теги изображений

source: Bulk translation may take time and require API credits.
ru_ru: Массовый перевод может занять время и потребовать кредиты API.

source: Start Translation
ru_ru: Начать перевод

source: Translation Results:
ru_ru: Результаты перевода:

source: Insufficient permissions
ru_ru: Недостаточно прав

source: Too many images to count. Use filters.
ru_ru: Слишком много изображений для подсчёта. Используйте фильтры.

source: Settings are empty
ru_ru: Настройки пусты

source: Settings successfully imported
ru_ru: Настройки успешно импортированы

source: Text to translate is empty
ru_ru: Текст для перевода пуст

source: Google Translate API key not specified
ru_ru: API ключ Google Translate не указан

source: DeepL API key not specified
ru_ru: API ключ DeepL не указан

source: Yandex Translator API key not specified
ru_ru: API ключ Яндекс.Переводчик не указан

source: Unknown translation service
ru_ru: Неизвестный сервис перевода

source: Invalid API response
ru_ru: Неверный ответ API

source: Processed:
ru_ru: Обработано:

source: Success:
ru_ru: Успешно:

source: Errors:
ru_ru: Ошибок:

source: Are you sure you want to start processing images?
ru_ru: Вы уверены, что хотите начать обработку изображений?

source: Run test processing? (changes will not be saved)
ru_ru: Запустить тестовую обработку? (изменения не будут сохранены)

source: Are you sure? This action cannot be undone!
ru_ru: Вы уверены? Это действие нельзя отменить!

source: Start bulk translation of all tags?
ru_ru: Начать массовый перевод всех тегов?

source: empty
ru_ru: пусто

source: no changes
ru_ru: нет изменений

source: Total images:
ru_ru: Всего изображений:

source: Without ALT:
ru_ru: Без ALT:

source: Without TITLE:
ru_ru: Без TITLE:

source: Will be processed:
ru_ru: Будет обработано:

source: No images to process with selected filters.
ru_ru: Нет изображений для обработки с выбранными фильтрами.

source: Processing completed!
ru_ru: Обработка завершена!

source: TEST MODE
ru_ru: ТЕСТОВЫЙ РЕЖИМ

source: This was a test run. Changes were not saved.
ru_ru: Это был тестовый запуск. Изменения не сохранены.

source: Successfully processed:
ru_ru: Успешно обработано:

source: Removal completed!
ru_ru: Удаление завершено!

source: Images processed:
ru_ru: Изображений обработано:

source: Translation completed!
ru_ru: Перевод завершён!

source: Successfully translated:
ru_ru: Успешно переведено:

source: Removed:
ru_ru: Удалено:

source: Translated:
ru_ru: Переведено:

source: Original:
ru_ru: Оригинал:

source: Translation:
ru_ru: Перевод:

source: Settings successfully imported!
ru_ru: Настройки успешно импортированы!

source: Error: invalid file format
ru_ru: Ошибка: неверный формат файла

source: Select at least one tag type to remove
ru_ru: Выберите хотя бы один тип тега для удаления

source: Enter text to translate
ru_ru: Введите текст для перевода

source: Translating...
ru_ru: Перевод...

source: Connection error
ru_ru: Ошибка соединения

source: Found images with tags:
ru_ru: Найдено изображений с тегами:

source: Found images:
ru_ru: Найдено изображений:

source: Process Again
ru_ru: Обработать снова
